src/InformationRegisters/ОткрытыеЗаказыПоКартам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ОткрытыеЗаказыПоКартам</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Заказ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущийАвтор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяПоследнейАктивности</Name>
					<Comment>время последней активности бейджа на станции</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МестоПоследнейАктивности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМеста</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>КартаДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КартыДоступа</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ОткрытыеЗаказыПоКартам/Ext/ManagerModule.bsl
Процедура ОчиститьПривязкиДоДатыВключительно(Дата) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Дата", Дата);
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОткрытыеЗаказыПоКартам.КартаДоступа КАК КартаДоступа,
	|	ОткрытыеЗаказыПоКартам.Заказ КАК Заказ,
	|	ОткрытыеЗаказыПоКартам.ТекущийАвтор КАК ТекущийАвтор,
	|	ОткрытыеЗаказыПоКартам.ВремяПоследнейАктивности КАК ВремяПоследнейАктивности,
	|	ОткрытыеЗаказыПоКартам.МестоПоследнейАктивности КАК МестоПоследнейАктивности
	|ИЗ
	|	РегистрСведений.ОткрытыеЗаказыПоКартам КАК ОткрытыеЗаказыПоКартам
	|ГДЕ
	|	РАЗНОСТЬДАТ(&Дата, ОткрытыеЗаказыПоКартам.Заказ.Дата, ДЕНЬ) > 0";
	
	НЗ = СоздатьНаборЗаписей();
	НЗ.Загрузить(Запрос.Выполнить().Выгрузить());
	НЗ.Записывать(Истина);
		
КонецПроцедуры
